; ModuleID = 'egress_test_tf.c'
source_filename = "egress_test_tf.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_elf_map = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.vtl_hdr_t = type { i8, i32, i16, i16 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }

@QOS_NEGO_MAP = global %struct.bpf_elf_map { i32 2, i32 4, i32 4, i32 1, i32 0, i32 0, i32 2 }, section "maps", align 4, !dbg !0
@_tf_tc_egress.____fmt = private unnamed_addr constant [30 x i8] c"gid = %d ==> this is a DATA.\0A\00", align 1
@_tf_tc_egress.____fmt.1 = private unnamed_addr constant [22 x i8] c"pkt send to nic = %d\0A\00", align 1
@_tf_tc_egress.____fmt.2 = private unnamed_addr constant [30 x i8] c"gid = %d ==> this is a NEGO.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "QOS_NEGO_MAP", scope: !2, file: !3, line: 15, type: !110, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !83)
!3 = !DIFile(filename: "egress_test_tf.c", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!4 = !{!5, !14, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 64, size: 32, elements: !7)
!6 = !DIFile(filename: "./../include/vtl.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "NEGO", value: 0)
!9 = !DIEnumerator(name: "DATA", value: 1)
!10 = !DIEnumerator(name: "ACK", value: 2)
!11 = !DIEnumerator(name: "NACK", value: 3)
!12 = !DIEnumerator(name: "NEGO_ACK", value: 4)
!13 = !DIEnumerator(name: "NEGO_NACK", value: 5)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 49, size: 32, elements: !15)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "N_ACCEPT", value: 0)
!17 = !DIEnumerator(name: "N_REFUSE", value: 1)
!18 = !DIEnumerator(name: "N_IDLE", value: 2)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !20, line: 2847, size: 32, elements: !21)
!20 = !DIFile(filename: "./include/linux/bpf.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!23 = !DIEnumerator(name: "XDP_DROP", value: 1)
!24 = !DIEnumerator(name: "XDP_PASS", value: 2)
!25 = !DIEnumerator(name: "XDP_TX", value: 3)
!26 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!27 = !{!28, !29, !30, !46, !70}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !32, line: 163, size: 112, elements: !33)
!32 = !DIFile(filename: "./include/linux/if_ether.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!33 = !{!34, !39, !40}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !31, file: !32, line: 164, baseType: !35, size: 48)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 48, elements: !37)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !{!38}
!38 = !DISubrange(count: 6)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !31, file: !32, line: 165, baseType: !35, size: 48, offset: 48)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !31, file: !32, line: 166, baseType: !41, size: 16, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !42, line: 25, baseType: !43)
!42 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !44, line: 24, baseType: !45)
!44 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !48, line: 44, size: 160, elements: !49)
!48 = !DIFile(filename: "/usr/include/netinet/ip.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!49 = !{!50, !52, !53, !58, !61, !62, !63, !64, !65, !66, !69}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !47, file: !48, line: 47, baseType: !51, size: 4, flags: DIFlagBitField, extraData: i64 0)
!51 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !47, file: !48, line: 48, baseType: !51, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !47, file: !48, line: 55, baseType: !54, size: 8, offset: 8)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !55, line: 24, baseType: !56)
!55 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !57, line: 37, baseType: !36)
!57 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !47, file: !48, line: 56, baseType: !59, size: 16, offset: 16)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !55, line: 25, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !57, line: 39, baseType: !45)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !47, file: !48, line: 57, baseType: !59, size: 16, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !47, file: !48, line: 58, baseType: !59, size: 16, offset: 48)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !47, file: !48, line: 59, baseType: !54, size: 8, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !47, file: !48, line: 60, baseType: !54, size: 8, offset: 72)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !47, file: !48, line: 61, baseType: !59, size: 16, offset: 80)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !47, file: !48, line: 62, baseType: !67, size: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !55, line: 26, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 41, baseType: !51)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !47, file: !48, line: 63, baseType: !67, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "vtl_hdr_t", file: !6, line: 81, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 76, size: 96, elements: !73)
!73 = !{!74, !79, !81, !82}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !72, file: !6, line: 77, baseType: !75, size: 8)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !76, line: 24, baseType: !77)
!76 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !57, line: 36, baseType: !78)
!78 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !72, file: !6, line: 78, baseType: !80, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "vtl_pkt_type", file: !6, line: 71, baseType: !5)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !72, file: !6, line: 79, baseType: !59, size: 16, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !72, file: !6, line: 80, baseType: !59, size: 16, offset: 80)
!83 = !{!0, !84, !90, !99, !105}
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 129, type: !86, isLocal: false, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 32, elements: !88)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !{!89}
!89 = !DISubrange(count: 4)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !92, line: 40, type: !93, isLocal: true, isDefinition: true)
!92 = !DIFile(filename: "./include/bpf/bpf_helpers.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97, !96, null}
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "bpf_vtl_nic_tx", scope: !2, file: !92, line: 55, type: !101, isLocal: true, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!96, !28, !96, !104, !96}
!104 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !92, line: 22, type: !107, isLocal: true, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!96, !28, !28, !28, !104}
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_elf_map", file: !111, line: 18, size: 224, elements: !112)
!111 = !DIFile(filename: "./include/bpf/tc_bpf_util.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!112 = !{!113, !115, !116, !117, !118, !119, !120}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !111, line: 23, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !44, line: 27, baseType: !51)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "size_key", scope: !110, file: !111, line: 24, baseType: !114, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "size_value", scope: !110, file: !111, line: 25, baseType: !114, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max_elem", scope: !110, file: !111, line: 26, baseType: !114, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !111, line: 30, baseType: !114, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 31, baseType: !114, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !110, file: !111, line: 40, baseType: !114, size: 32, offset: 192)
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{i32 1, !"wchar_size", i32 4}
!124 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!125 = distinct !DISubprogram(name: "_tf_tc_egress", scope: !3, file: !3, line: 58, type: !126, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !217)
!126 = !DISubroutineType(types: !127)
!127 = !{!96, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !20, line: 2679, size: 1408, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !147, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158, !159, !160, !161, !193, !195, !196, !197}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !129, file: !20, line: 2680, baseType: !114, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !129, file: !20, line: 2681, baseType: !114, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !129, file: !20, line: 2682, baseType: !114, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !129, file: !20, line: 2683, baseType: !114, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !129, file: !20, line: 2684, baseType: !114, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !129, file: !20, line: 2685, baseType: !114, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !129, file: !20, line: 2686, baseType: !114, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !129, file: !20, line: 2687, baseType: !114, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !129, file: !20, line: 2688, baseType: !114, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !129, file: !20, line: 2689, baseType: !114, size: 32, offset: 288)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !129, file: !20, line: 2690, baseType: !114, size: 32, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !129, file: !20, line: 2691, baseType: !114, size: 32, offset: 352)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !129, file: !20, line: 2692, baseType: !144, size: 160, offset: 384)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 160, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 5)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !129, file: !20, line: 2693, baseType: !114, size: 32, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !129, file: !20, line: 2694, baseType: !114, size: 32, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !20, line: 2695, baseType: !114, size: 32, offset: 608)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !129, file: !20, line: 2696, baseType: !114, size: 32, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !129, file: !20, line: 2697, baseType: !114, size: 32, offset: 672)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !129, file: !20, line: 2700, baseType: !114, size: 32, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !129, file: !20, line: 2701, baseType: !114, size: 32, offset: 736)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !129, file: !20, line: 2702, baseType: !114, size: 32, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !129, file: !20, line: 2703, baseType: !156, size: 128, offset: 800)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !88)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !129, file: !20, line: 2704, baseType: !156, size: 128, offset: 928)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !129, file: !20, line: 2705, baseType: !114, size: 32, offset: 1056)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !129, file: !20, line: 2706, baseType: !114, size: 32, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !129, file: !20, line: 2709, baseType: !114, size: 32, offset: 1120)
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !20, line: 2710, baseType: !162, size: 64, align: 64, offset: 1152)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !20, line: 2710, size: 64, align: 64, elements: !163)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !162, file: !20, line: 2710, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !20, line: 3242, size: 384, elements: !167)
!167 = !{!168, !169, !170, !171, !173, !174, !175, !176, !177, !178, !179}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !166, file: !20, line: 3243, baseType: !43, size: 16)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !166, file: !20, line: 3244, baseType: !43, size: 16, offset: 16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !166, file: !20, line: 3245, baseType: !43, size: 16, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !166, file: !20, line: 3246, baseType: !172, size: 8, offset: 48)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !44, line: 21, baseType: !36)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !166, file: !20, line: 3247, baseType: !172, size: 8, offset: 56)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !166, file: !20, line: 3248, baseType: !172, size: 8, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !166, file: !20, line: 3249, baseType: !172, size: 8, offset: 72)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !166, file: !20, line: 3250, baseType: !41, size: 16, offset: 80)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !166, file: !20, line: 3251, baseType: !41, size: 16, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !166, file: !20, line: 3252, baseType: !41, size: 16, offset: 112)
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !20, line: 3253, baseType: !180, size: 256, offset: 128)
!180 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !20, line: 3253, size: 256, elements: !181)
!181 = !{!182, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !20, line: 3254, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !20, line: 3254, size: 64, elements: !184)
!184 = !{!185, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !183, file: !20, line: 3255, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !42, line: 27, baseType: !114)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !183, file: !20, line: 3256, baseType: !186, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !20, line: 3258, baseType: !189, size: 256)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !20, line: 3258, size: 256, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !189, file: !20, line: 3259, baseType: !156, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !189, file: !20, line: 3260, baseType: !156, size: 128, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !129, file: !20, line: 2711, baseType: !194, size: 64, offset: 1216)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !44, line: 31, baseType: !104)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !129, file: !20, line: 2712, baseType: !114, size: 32, offset: 1280)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !129, file: !20, line: 2713, baseType: !114, size: 32, offset: 1312)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !20, line: 2714, baseType: !198, size: 64, align: 64, offset: 1344)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !20, line: 2714, size: 64, align: 64, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !198, file: !20, line: 2714, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !20, line: 2767, size: 608, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !202, file: !20, line: 2768, baseType: !114, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !202, file: !20, line: 2769, baseType: !114, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !20, line: 2770, baseType: !114, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !202, file: !20, line: 2771, baseType: !114, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !202, file: !20, line: 2772, baseType: !114, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !202, file: !20, line: 2773, baseType: !114, size: 32, offset: 160)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !202, file: !20, line: 2775, baseType: !114, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !202, file: !20, line: 2776, baseType: !156, size: 128, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !202, file: !20, line: 2777, baseType: !114, size: 32, offset: 352)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !202, file: !20, line: 2778, baseType: !114, size: 32, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !202, file: !20, line: 2779, baseType: !114, size: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !202, file: !20, line: 2780, baseType: !156, size: 128, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !202, file: !20, line: 2781, baseType: !114, size: 32, offset: 576)
!217 = !{!218, !219, !220, !227, !232}
!218 = !DILocalVariable(name: "skb", arg: 1, scope: !125, file: !3, line: 58, type: !128)
!219 = !DILocalVariable(name: "vtlh", scope: !125, file: !3, line: 60, type: !70)
!220 = !DILocalVariable(name: "____fmt", scope: !221, file: !3, line: 66, type: !224)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 66, column: 5)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 64, column: 23)
!223 = distinct !DILexicalBlock(scope: !125, file: !3, line: 64, column: 6)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 240, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 30)
!227 = !DILocalVariable(name: "____fmt", scope: !228, file: !3, line: 67, type: !229)
!228 = distinct !DILexicalBlock(scope: !222, file: !3, line: 67, column: 5)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 176, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 22)
!232 = !DILocalVariable(name: "____fmt", scope: !233, file: !3, line: 73, type: !224)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 73, column: 5)
!234 = distinct !DILexicalBlock(scope: !223, file: !3, line: 72, column: 8)
!235 = !DILocalVariable(name: "____fmt", scope: !236, file: !3, line: 35, type: !224)
!236 = distinct !DILexicalBlock(scope: !237, file: !3, line: 35, column: 5)
!237 = distinct !DILexicalBlock(scope: !238, file: !3, line: 34, column: 25)
!238 = distinct !DILexicalBlock(scope: !239, file: !3, line: 34, column: 6)
!239 = distinct !DISubprogram(name: "egress_move_to_vtl_hdr", scope: !3, file: !3, line: 29, type: !240, isLocal: true, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{!70, !128}
!242 = !{!243, !244, !245, !246, !235, !247, !248, !255, !256}
!243 = !DILocalVariable(name: "skb", arg: 1, scope: !239, file: !3, line: 29, type: !128)
!244 = !DILocalVariable(name: "data", scope: !239, file: !3, line: 30, type: !28)
!245 = !DILocalVariable(name: "data_end", scope: !239, file: !3, line: 31, type: !28)
!246 = !DILocalVariable(name: "eth", scope: !239, file: !3, line: 33, type: !30)
!247 = !DILocalVariable(name: "iph", scope: !239, file: !3, line: 39, type: !46)
!248 = !DILocalVariable(name: "____fmt", scope: !249, file: !3, line: 41, type: !252)
!249 = distinct !DILexicalBlock(scope: !250, file: !3, line: 41, column: 5)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 40, column: 25)
!251 = distinct !DILexicalBlock(scope: !239, file: !3, line: 40, column: 6)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 232, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 29)
!255 = !DILocalVariable(name: "hdr", scope: !239, file: !3, line: 48, type: !70)
!256 = !DILocalVariable(name: "____fmt", scope: !257, file: !3, line: 50, type: !224)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 50, column: 5)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 49, column: 25)
!259 = distinct !DILexicalBlock(scope: !239, file: !3, line: 49, column: 6)
!260 = !DILocation(line: 35, column: 5, scope: !236, inlinedAt: !261)
!261 = distinct !DILocation(line: 60, column: 21, scope: !125)
!262 = !DILocation(line: 41, column: 5, scope: !249, inlinedAt: !261)
!263 = !DILocation(line: 50, column: 5, scope: !257, inlinedAt: !261)
!264 = !DILocation(line: 58, column: 37, scope: !125)
!265 = !DILocation(line: 29, column: 76, scope: !239, inlinedAt: !261)
!266 = !DILocation(line: 30, column: 35, scope: !239, inlinedAt: !261)
!267 = !{!268, !269, i64 76}
!268 = !{!"__sk_buff", !269, i64 0, !269, i64 4, !269, i64 8, !269, i64 12, !269, i64 16, !269, i64 20, !269, i64 24, !269, i64 28, !269, i64 32, !269, i64 36, !269, i64 40, !269, i64 44, !270, i64 48, !269, i64 68, !269, i64 72, !269, i64 76, !269, i64 80, !269, i64 84, !269, i64 88, !269, i64 92, !269, i64 96, !270, i64 100, !270, i64 116, !269, i64 132, !269, i64 136, !269, i64 140, !270, i64 144, !272, i64 152, !269, i64 160, !269, i64 164, !270, i64 168}
!269 = !{!"int", !270, i64 0}
!270 = !{!"omnipotent char", !271, i64 0}
!271 = !{!"Simple C/C++ TBAA"}
!272 = !{!"long long", !270, i64 0}
!273 = !DILocation(line: 30, column: 24, scope: !239, inlinedAt: !261)
!274 = !DILocation(line: 30, column: 9, scope: !239, inlinedAt: !261)
!275 = !DILocation(line: 31, column: 39, scope: !239, inlinedAt: !261)
!276 = !{!268, !269, i64 80}
!277 = !DILocation(line: 31, column: 28, scope: !239, inlinedAt: !261)
!278 = !DILocation(line: 31, column: 9, scope: !239, inlinedAt: !261)
!279 = !DILocation(line: 33, column: 24, scope: !239, inlinedAt: !261)
!280 = !DILocation(line: 33, column: 18, scope: !239, inlinedAt: !261)
!281 = !DILocation(line: 34, column: 10, scope: !238, inlinedAt: !261)
!282 = !DILocation(line: 34, column: 16, scope: !238, inlinedAt: !261)
!283 = !DILocation(line: 34, column: 14, scope: !238, inlinedAt: !261)
!284 = !DILocation(line: 34, column: 6, scope: !239, inlinedAt: !261)
!285 = !DILocation(line: 35, column: 5, scope: !237, inlinedAt: !261)
!286 = !DILocation(line: 36, column: 5, scope: !237, inlinedAt: !261)
!287 = !DILocation(line: 39, column: 17, scope: !239, inlinedAt: !261)
!288 = !DILocation(line: 40, column: 10, scope: !251, inlinedAt: !261)
!289 = !DILocation(line: 40, column: 16, scope: !251, inlinedAt: !261)
!290 = !DILocation(line: 40, column: 14, scope: !251, inlinedAt: !261)
!291 = !DILocation(line: 40, column: 6, scope: !239, inlinedAt: !261)
!292 = !DILocation(line: 41, column: 5, scope: !250, inlinedAt: !261)
!293 = !DILocation(line: 42, column: 5, scope: !250, inlinedAt: !261)
!294 = !DILocation(line: 45, column: 11, scope: !295, inlinedAt: !261)
!295 = distinct !DILexicalBlock(scope: !239, file: !3, line: 45, column: 6)
!296 = !{!297, !270, i64 9}
!297 = !{!"iphdr", !269, i64 0, !269, i64 0, !270, i64 1, !298, i64 2, !298, i64 4, !298, i64 6, !270, i64 8, !270, i64 9, !298, i64 10, !269, i64 12, !269, i64 16}
!298 = !{!"short", !270, i64 0}
!299 = !DILocation(line: 45, column: 20, scope: !295, inlinedAt: !261)
!300 = !DILocation(line: 45, column: 6, scope: !239, inlinedAt: !261)
!301 = !DILocation(line: 49, column: 10, scope: !259, inlinedAt: !261)
!302 = !DILocation(line: 49, column: 16, scope: !259, inlinedAt: !261)
!303 = !DILocation(line: 49, column: 14, scope: !259, inlinedAt: !261)
!304 = !DILocation(line: 49, column: 6, scope: !239, inlinedAt: !261)
!305 = !DILocation(line: 50, column: 5, scope: !258, inlinedAt: !261)
!306 = !DILocation(line: 51, column: 5, scope: !258, inlinedAt: !261)
!307 = !DILocation(line: 60, column: 14, scope: !125)
!308 = !DILocation(line: 64, column: 12, scope: !223)
!309 = !{!310, !270, i64 0}
!310 = !{!"", !270, i64 0, !270, i64 4, !298, i64 8, !298, i64 10}
!311 = !DILocation(line: 64, column: 16, scope: !223)
!312 = !DILocation(line: 64, column: 6, scope: !125)
!313 = !DILocation(line: 66, column: 5, scope: !221)
!314 = !DILocation(line: 66, column: 5, scope: !222)
!315 = !DILocation(line: 67, column: 5, scope: !228)
!316 = !{!268, !269, i64 40}
!317 = !DILocation(line: 67, column: 5, scope: !222)
!318 = !DILocation(line: 68, column: 11, scope: !222)
!319 = !DILocation(line: 68, column: 20, scope: !222)
!320 = !{!310, !270, i64 4}
!321 = !DILocation(line: 69, column: 20, scope: !222)
!322 = !DILocation(line: 69, column: 30, scope: !222)
!323 = !DILocation(line: 69, column: 37, scope: !222)
!324 = !DILocation(line: 69, column: 5, scope: !222)
!325 = !DILocation(line: 71, column: 3, scope: !222)
!326 = !DILocation(line: 73, column: 5, scope: !233)
!327 = !DILocation(line: 73, column: 5, scope: !234)
!328 = !DILocation(line: 74, column: 11, scope: !234)
!329 = !DILocation(line: 74, column: 20, scope: !234)
!330 = !DILocation(line: 75, column: 20, scope: !234)
!331 = !DILocation(line: 75, column: 30, scope: !234)
!332 = !DILocation(line: 75, column: 37, scope: !234)
!333 = !DILocation(line: 75, column: 5, scope: !234)
!334 = !DILocation(line: 79, column: 1, scope: !125)
!335 = distinct !DISubprogram(name: "_listener_tf", scope: !3, file: !3, line: 82, type: !336, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !346)
!336 = !DISubroutineType(types: !337)
!337 = !{!96, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !20, line: 2858, size: 160, elements: !340)
!340 = !{!341, !342, !343, !344, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !339, file: !20, line: 2859, baseType: !114, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !339, file: !20, line: 2860, baseType: !114, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !339, file: !20, line: 2861, baseType: !114, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !339, file: !20, line: 2863, baseType: !114, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !339, file: !20, line: 2864, baseType: !114, size: 32, offset: 128)
!346 = !{!347, !348, !349, !351, !352, !353, !354, !361, !362, !369, !370, !374, !381, !385, !386}
!347 = !DILocalVariable(name: "ctx", arg: 1, scope: !335, file: !3, line: 82, type: !338)
!348 = !DILocalVariable(name: "index", scope: !335, file: !3, line: 83, type: !96)
!349 = !DILocalVariable(name: "nego_state", scope: !335, file: !3, line: 84, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "negotiation_state", file: !6, line: 53, baseType: !14)
!351 = !DILocalVariable(name: "data", scope: !335, file: !3, line: 86, type: !28)
!352 = !DILocalVariable(name: "data_end", scope: !335, file: !3, line: 87, type: !28)
!353 = !DILocalVariable(name: "eth", scope: !335, file: !3, line: 89, type: !30)
!354 = !DILocalVariable(name: "____fmt", scope: !355, file: !3, line: 91, type: !358)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 91, column: 5)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 90, column: 25)
!357 = distinct !DILexicalBlock(scope: !335, file: !3, line: 90, column: 6)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 312, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 39)
!361 = !DILocalVariable(name: "iph", scope: !335, file: !3, line: 95, type: !46)
!362 = !DILocalVariable(name: "____fmt", scope: !363, file: !3, line: 97, type: !366)
!363 = distinct !DILexicalBlock(scope: !364, file: !3, line: 97, column: 5)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 96, column: 25)
!365 = distinct !DILexicalBlock(scope: !335, file: !3, line: 96, column: 6)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 304, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 38)
!369 = !DILocalVariable(name: "vtlh", scope: !335, file: !3, line: 104, type: !70)
!370 = !DILocalVariable(name: "____fmt", scope: !371, file: !3, line: 106, type: !358)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 106, column: 5)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 105, column: 26)
!373 = distinct !DILexicalBlock(scope: !335, file: !3, line: 105, column: 6)
!374 = !DILocalVariable(name: "____fmt", scope: !375, file: !3, line: 112, type: !378)
!375 = distinct !DILexicalBlock(scope: !376, file: !3, line: 112, column: 5)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 110, column: 34)
!377 = distinct !DILexicalBlock(scope: !335, file: !3, line: 110, column: 6)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 168, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 21)
!381 = !DILocalVariable(name: "____fmt", scope: !382, file: !3, line: 116, type: !229)
!382 = distinct !DILexicalBlock(scope: !383, file: !3, line: 116, column: 5)
!383 = distinct !DILexicalBlock(scope: !384, file: !3, line: 114, column: 40)
!384 = distinct !DILexicalBlock(scope: !377, file: !3, line: 114, column: 11)
!385 = !DILocalVariable(name: "ret", scope: !335, file: !3, line: 120, type: !29)
!386 = !DILocalVariable(name: "____fmt", scope: !387, file: !3, line: 122, type: !390)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 122, column: 5)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 121, column: 16)
!389 = distinct !DILexicalBlock(scope: !335, file: !3, line: 121, column: 6)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 280, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 35)
!393 = !DILocation(line: 82, column: 33, scope: !335)
!394 = !DILocation(line: 83, column: 3, scope: !335)
!395 = !DILocation(line: 83, column: 7, scope: !335)
!396 = !{!269, !269, i64 0}
!397 = !DILocation(line: 84, column: 3, scope: !335)
!398 = !DILocation(line: 84, column: 21, scope: !335)
!399 = !{!270, !270, i64 0}
!400 = !DILocation(line: 86, column: 35, scope: !335)
!401 = !{!402, !269, i64 0}
