; ModuleID = 'hooker_test_progs.c'
source_filename = "hooker_test_progs.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.tcp_opt = type { i8, i8, i16 }
%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.bpf_sock_ops = type { i32, %union.anon, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64 }
%union.anon = type { [4 x i32] }
%struct.vtl_tcp_stream_info = type { i8, i32, i32, i64, i64, i64, i64, i32, %union.anon.0, i64, i16, i16, i8, i8, %struct.ndpi_proto, %struct.ndpi_proto, %struct.ndpi_flow_struct*, %struct.ndpi_id_struct*, %struct.ndpi_id_struct* }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [2 x i64], [2 x i64] }
%struct.ndpi_proto = type { i16, i16, i32 }
%struct.ndpi_flow_struct = type { [2 x i16], i16, i16, i16, i16, i16, i8, i8, [2 x i32], i8, i8, i8, i32 (%struct.ndpi_detection_module_struct*, %struct.ndpi_flow_struct*)*, %union.anon.2, [16 x i8], %struct.ndpi_id_struct*, [240 x i8], [8 x i8], i8, i8, i32, %struct.anon.6, %struct.anon.7, %union.anon.8, %struct.ndpi_protocol_bitmask_struct, i32, i8, i8, i16, [2 x i16], [2 x i16], i8, i8, i16, i8, i8, i8, i8, i8, [8 x i8], i8, i8, %struct.tinc_cache_entry, [18 x i8], i8, i8, i32, %struct.ndpi_packet_struct, %struct.ndpi_flow_struct*, %struct.ndpi_id_struct*, %struct.ndpi_id_struct* }

!32 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_CUSTOM_1", value: 20)
!33 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_CUSTOM_2", value: 21)
!34 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_CUSTOM_3", value: 22)
!35 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_CUSTOM_4", value: 23)
!36 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_CUSTOM_5", value: 24)
!37 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_MUSIC", value: 25)
!38 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_VIDEO", value: 26)
!39 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_SHOPPING", value: 27)
!40 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_PRODUCTIVITY", value: 28)
!41 = !DIEnumerator(name: "NDPI_PROTOCOL_CATEGORY_FILE_SHARING", value: 29)
!42 = !DIEnumerator(name: "CUSTOM_CATEGORY_MINING", value: 99)
!43 = !DIEnumerator(name: "CUSTOM_CATEGORY_MALWARE", value: 100)
!44 = !DIEnumerator(name: "CUSTOM_CATEGORY_ADVERTISEMENT", value: 101)
!45 = !DIEnumerator(name: "CUSTOM_CATEGORY_BANNED_SITE", value: 102)
!46 = !DIEnumerator(name: "CUSTOM_CATEGORY_SITE_UNAVAILABLE", value: 103)
!47 = !DIEnumerator(name: "CUSTOM_CATEGORY_ALLOWED_SITE", value: 104)
!48 = !DIEnumerator(name: "CUSTOM_CATEGORY_ANTIMALWARE", value: 105)
!49 = !DIEnumerator(name: "NDPI_PROTOCOL_NUM_CATEGORIES", value: 106)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 475, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!52 = !DIEnumerator(name: "NDPI_HTTP_METHOD_UNKNOWN", value: 0)
!53 = !DIEnumerator(name: "NDPI_HTTP_METHOD_OPTIONS", value: 1)
!54 = !DIEnumerator(name: "NDPI_HTTP_METHOD_GET", value: 2)
!55 = !DIEnumerator(name: "NDPI_HTTP_METHOD_HEAD", value: 3)
!56 = !DIEnumerator(name: "NDPI_HTTP_METHOD_PATCH", value: 4)
!57 = !DIEnumerator(name: "NDPI_HTTP_METHOD_POST", value: 5)
!58 = !DIEnumerator(name: "NDPI_HTTP_METHOD_PUT", value: 6)
!59 = !DIEnumerator(name: "NDPI_HTTP_METHOD_DELETE", value: 7)
!60 = !DIEnumerator(name: "NDPI_HTTP_METHOD_TRACE", value: 8)
!61 = !DIEnumerator(name: "NDPI_HTTP_METHOD_CONNECT", value: 9)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 1120, size: 32, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIEnumerator(name: "ndpi_cipher_safe", value: 0)
!65 = !DIEnumerator(name: "ndpi_cipher_weak", value: 1)
!66 = !DIEnumerator(name: "ndpi_cipher_insecure", value: 2)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tcp_host_role", file: !68, line: 43, size: 32, elements: !69)
!68 = !DIFile(filename: "./../include/vtl.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!69 = !{!70, !71}
!70 = !DIEnumerator(name: "TCP_CLIENT", value: 1)
!71 = !DIEnumerator(name: "TCP_SERVER", value: 2)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sk_action", file: !73, line: 2868, size: 32, elements: !74)
!73 = !DIFile(filename: "./include/linux/bpf.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!74 = !{!75, !76}
!75 = !DIEnumerator(name: "SK_DROP", value: 0)
!76 = !DIEnumerator(name: "SK_PASS", value: 1)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !73, line: 2848, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!80 = !DIEnumerator(name: "XDP_DROP", value: 1)
!81 = !DIEnumerator(name: "XDP_PASS", value: 2)
!82 = !DIEnumerator(name: "XDP_TX", value: 3)
!83 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 40, size: 32, elements: !86)
!85 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!87 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!88 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!89 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!90 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!91 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!92 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!93 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!94 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!95 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!96 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!97 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!98 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!99 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!100 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!101 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!102 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!103 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!104 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!105 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!106 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!107 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!108 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!109 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!110 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!111 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!112 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!113 = !{!114, !115, !125, !126, !731, !732, !743, !758, !798, !799, !800, !802}
!114 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream_tuple", file: !68, line: 158, size: 128, elements: !117)
!117 = !{!118, !122, !123, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip", scope: !116, file: !68, line: 159, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !120, line: 27, baseType: !121)
!120 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!121 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip", scope: !116, file: !68, line: 160, baseType: !119, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !116, file: !68, line: 161, baseType: !119, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !116, file: !68, line: 162, baseType: !119, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vtl_tcp_stream_info", file: !3, line: 33, size: 1152, elements: !128)
!128 = !{!129, !135, !138, !139, !141, !144, !145, !146, !147, !163, !164, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !186, !187, !729, !730}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !127, file: !3, line: 34, baseType: !130, size: 8)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !131, line: 24, baseType: !132)
!131 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !133, line: 37, baseType: !134)
!133 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "profil", scope: !127, file: !3, line: 35, baseType: !136, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !131, line: 26, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !133, line: 41, baseType: !121)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !127, file: !3, line: 36, baseType: !136, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "packets_processed", scope: !127, file: !3, line: 37, baseType: !140, size: 64, offset: 128)
!140 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "first_seen", scope: !127, file: !3, line: 38, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !131, line: 27, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !133, line: 47, baseType: !140)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "last_seen", scope: !127, file: !3, line: 39, baseType: !142, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hash_val", scope: !127, file: !3, line: 40, baseType: !142, size: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "l3_type", scope: !127, file: !3, line: 42, baseType: !5, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tuple", scope: !127, file: !3, line: 53, baseType: !148, size: 256, offset: 448)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !3, line: 44, size: 256, elements: !149)
!149 = !{!150, !155}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !148, file: !3, line: 48, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !3, line: 45, size: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !151, file: !3, line: 46, baseType: !136, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !151, file: !3, line: 47, baseType: !136, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !148, file: !3, line: 52, baseType: !156, size: 256)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !3, line: 49, size: 256, elements: !157)
!157 = !{!158, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !156, file: !3, line: 50, baseType: !159, size: 128)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 2)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !156, file: !3, line: 51, baseType: !159, size: 128, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "total_tcp_data_len", scope: !127, file: !3, line: 55, baseType: !140, size: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !127, file: !3, line: 56, baseType: !165, size: 16, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !131, line: 25, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !133, line: 39, baseType: !167)
!167 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !127, file: !3, line: 57, baseType: !165, size: 16, offset: 784)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "is_mid_stream", scope: !127, file: !3, line: 59, baseType: !130, size: 1, offset: 800, flags: DIFlagBitField, extraData: i64 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "stream_fin_ack_seen", scope: !127, file: !3, line: 60, baseType: !130, size: 1, offset: 801, flags: DIFlagBitField, extraData: i64 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "stream_ack_seen", scope: !127, file: !3, line: 61, baseType: !130, size: 1, offset: 802, flags: DIFlagBitField, extraData: i64 800)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "detection_completed", scope: !127, file: !3, line: 62, baseType: !130, size: 1, offset: 803, flags: DIFlagBitField, extraData: i64 800)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tls_client_hello_seen", scope: !127, file: !3, line: 63, baseType: !130, size: 1, offset: 804, flags: DIFlagBitField, extraData: i64 800)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tls_server_hello_seen", scope: !127, file: !3, line: 64, baseType: !130, size: 1, offset: 805, flags: DIFlagBitField, extraData: i64 800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_00", scope: !127, file: !3, line: 65, baseType: !130, size: 2, offset: 806, flags: DIFlagBitField, extraData: i64 800)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "l4_proto", scope: !127, file: !3, line: 69, baseType: !130, size: 8, offset: 808)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "detected_l7_proto", scope: !127, file: !3, line: 71, baseType: !178, size: 64, offset: 832)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_proto", file: !10, line: 971, size: 64, elements: !179)
!179 = !{!180, !183, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "master_protocol", scope: !178, file: !10, line: 977, baseType: !181, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !182, line: 179, baseType: !167)
!182 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "app_protocol", scope: !178, file: !10, line: 977, baseType: !181, size: 16, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !178, file: !10, line: 978, baseType: !185, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ndpi_protocol_category_t", file: !10, line: 942, baseType: !9)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "guessed_proto", scope: !127, file: !3, line: 72, baseType: !178, size: 64, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ndpi_flow", scope: !127, file: !3, line: 74, baseType: !188, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_flow_struct", file: !10, line: 1131, size: 17984, elements: !190)
!190 = !{!191, !193, !194, !195, !196, !197, !198, !200, !201, !202, !203, !204, !205, !206, !209, !210, !211, !212, !218, !328, !333, !403, !407, !409, !410, !411, !412, !425, !431, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !606, !610, !611, !612, !613, !726, !727, !728}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "detected_protocol_stack", scope: !189, file: !10, line: 1132, baseType: !192, size: 32)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 32, elements: !160)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_stack_info", scope: !189, file: !10, line: 1133, baseType: !181, size: 16, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "guessed_protocol_id", scope: !189, file: !10, line: 1136, baseType: !181, size: 16, offset: 48)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "guessed_host_protocol_id", scope: !189, file: !10, line: 1136, baseType: !181, size: 16, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "guessed_category", scope: !189, file: !10, line: 1136, baseType: !181, size: 16, offset: 80)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "guessed_header_category", scope: !189, file: !10, line: 1136, baseType: !181, size: 16, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "l4_proto", scope: !189, file: !10, line: 1137, baseType: !199, size: 8, offset: 112)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !182, line: 178, baseType: !134)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_id_already_guessed", scope: !189, file: !10, line: 1137, baseType: !199, size: 1, offset: 120, flags: DIFlagBitField, extraData: i64 120)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "host_already_guessed", scope: !189, file: !10, line: 1137, baseType: !199, size: 1, offset: 121, flags: DIFlagBitField, extraData: i64 120)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "init_finished", scope: !189, file: !10, line: 1138, baseType: !199, size: 1, offset: 122, flags: DIFlagBitField, extraData: i64 120)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "setup_packet_direction", scope: !189, file: !10, line: 1138, baseType: !199, size: 1, offset: 123, flags: DIFlagBitField, extraData: i64 120)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "packet_direction", scope: !189, file: !10, line: 1138, baseType: !199, size: 1, offset: 124, flags: DIFlagBitField, extraData: i64 120)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "check_extra_packets", scope: !189, file: !10, line: 1138, baseType: !199, size: 1, offset: 125, flags: DIFlagBitField, extraData: i64 120)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next_tcp_seq_nr", scope: !189, file: !10, line: 1144, baseType: !207, size: 64, offset: 128)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !160)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !182, line: 180, baseType: !121)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "max_extra_packets_to_check", scope: !189, file: !10, line: 1146, baseType: !199, size: 8, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra_packets_checked", scope: !189, file: !10, line: 1147, baseType: !199, size: 8, offset: 200)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "num_processed_pkts", scope: !189, file: !10, line: 1148, baseType: !199, size: 8, offset: 208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "extra_packets_func", scope: !189, file: !10, line: 1150, baseType: !213, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!114, !216, !188}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_detection_module_struct", file: !10, line: 844, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "l4", scope: !189, file: !10, line: 1159, baseType: !219, size: 768, offset: 320)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !10, line: 1156, size: 768, elements: !220)
!220 = !{!221, !308}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !219, file: !10, line: 1157, baseType: !222, size: 768)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_flow_tcp_struct", file: !10, line: 585, size: 768, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !305, !306, !307}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_command_bitmask", scope: !222, file: !10, line: 587, baseType: !181, size: 16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pop_command_bitmask", scope: !222, file: !10, line: 590, baseType: !181, size: 16, offset: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "qq_nxt_len", scope: !222, file: !10, line: 593, baseType: !181, size: 16, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "wa_matched_so_far", scope: !222, file: !10, line: 596, baseType: !199, size: 8, offset: 48)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tds_login_version", scope: !222, file: !10, line: 599, baseType: !199, size: 8, offset: 56)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "irc_stage", scope: !222, file: !10, line: 602, baseType: !199, size: 8, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "irc_port", scope: !222, file: !10, line: 603, baseType: !199, size: 8, offset: 72)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "h323_valid_packets", scope: !222, file: !10, line: 606, baseType: !199, size: 8, offset: 80)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gnutella_msg_id", scope: !222, file: !10, line: 609, baseType: !233, size: 24, offset: 88)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 24, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 3)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "irc_3a_counter", scope: !222, file: !10, line: 612, baseType: !208, size: 3, offset: 112, flags: DIFlagBitField, extraData: i64 112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "irc_stage2", scope: !222, file: !10, line: 613, baseType: !208, size: 5, offset: 115, flags: DIFlagBitField, extraData: i64 112)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "irc_direction", scope: !222, file: !10, line: 614, baseType: !208, size: 2, offset: 120, flags: DIFlagBitField, extraData: i64 112)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "irc_0x1000_full", scope: !222, file: !10, line: 615, baseType: !208, size: 1, offset: 122, flags: DIFlagBitField, extraData: i64 112)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "soulseek_stage", scope: !222, file: !10, line: 618, baseType: !208, size: 2, offset: 123, flags: DIFlagBitField, extraData: i64 112)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tds_stage", scope: !222, file: !10, line: 621, baseType: !208, size: 3, offset: 125, flags: DIFlagBitField, extraData: i64 112)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "usenet_stage", scope: !222, file: !10, line: 624, baseType: !208, size: 2, offset: 128, flags: DIFlagBitField, extraData: i64 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "imesh_stage", scope: !222, file: !10, line: 627, baseType: !208, size: 4, offset: 130, flags: DIFlagBitField, extraData: i64 112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "http_setup_dir", scope: !222, file: !10, line: 630, baseType: !208, size: 2, offset: 134, flags: DIFlagBitField, extraData: i64 112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "http_stage", scope: !222, file: !10, line: 631, baseType: !208, size: 2, offset: 136, flags: DIFlagBitField, extraData: i64 112)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "http_empty_line_seen", scope: !222, file: !10, line: 632, baseType: !208, size: 1, offset: 138, flags: DIFlagBitField, extraData: i64 112)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "http_wait_for_retransmission", scope: !222, file: !10, line: 633, baseType: !208, size: 1, offset: 139, flags: DIFlagBitField, extraData: i64 112)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gnutella_stage", scope: !222, file: !10, line: 636, baseType: !208, size: 2, offset: 140, flags: DIFlagBitField, extraData: i64 112)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mms_stage", scope: !222, file: !10, line: 639, baseType: !208, size: 2, offset: 142, flags: DIFlagBitField, extraData: i64 112)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "yahoo_sip_comm", scope: !222, file: !10, line: 642, baseType: !208, size: 1, offset: 144, flags: DIFlagBitField, extraData: i64 112)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "yahoo_http_proxy_stage", scope: !222, file: !10, line: 643, baseType: !208, size: 2, offset: 145, flags: DIFlagBitField, extraData: i64 112)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "msn_stage", scope: !222, file: !10, line: 646, baseType: !208, size: 3, offset: 147, flags: DIFlagBitField, extraData: i64 112)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "msn_ssl_ft", scope: !222, file: !10, line: 647, baseType: !208, size: 2, offset: 150, flags: DIFlagBitField, extraData: i64 112)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_stage", scope: !222, file: !10, line: 650, baseType: !208, size: 3, offset: 152, flags: DIFlagBitField, extraData: i64 112)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vnc_stage", scope: !222, file: !10, line: 653, baseType: !208, size: 2, offset: 155, flags: DIFlagBitField, extraData: i64 112)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "telnet_stage", scope: !222, file: !10, line: 656, baseType: !208, size: 2, offset: 157, flags: DIFlagBitField, extraData: i64 112)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !222, file: !10, line: 670, baseType: !258, size: 384, offset: 192)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !222, file: !10, line: 658, size: 384, elements: !259)
!259 = !{!260, !269, !270, !271, !272, !273, !274, !275}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !258, file: !10, line: 662, baseType: !261, size: 128)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !10, line: 659, size: 128, elements: !262)
!262 = !{!263, !265, !268}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !261, file: !10, line: 660, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_len", scope: !261, file: !10, line: 661, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !182, line: 35, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !133, line: 32, baseType: !121)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_used", scope: !261, file: !10, line: 661, baseType: !266, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "srv_cert_fingerprint_ctx", scope: !258, file: !10, line: 664, baseType: !125, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "hello_processed", scope: !258, file: !10, line: 667, baseType: !199, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "certificate_processed", scope: !258, file: !10, line: 667, baseType: !199, size: 1, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "subprotocol_detected", scope: !258, file: !10, line: 667, baseType: !199, size: 1, offset: 194, flags: DIFlagBitField, extraData: i64 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint_set", scope: !258, file: !10, line: 668, baseType: !199, size: 1, offset: 195, flags: DIFlagBitField, extraData: i64 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !258, file: !10, line: 668, baseType: !199, size: 4, offset: 196, flags: DIFlagBitField, extraData: i64 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_certificate_fingerprint", scope: !258, file: !10, line: 669, baseType: !276, size: 160, offset: 200)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 160, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 20)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "postgres_stage", scope: !222, file: !10, line: 673, baseType: !208, size: 3, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ddlink_server_direction", scope: !222, file: !10, line: 676, baseType: !208, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "seen_syn", scope: !222, file: !10, line: 677, baseType: !208, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "seen_syn_ack", scope: !222, file: !10, line: 678, baseType: !208, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "seen_ack", scope: !222, file: !10, line: 679, baseType: !208, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "icecast_stage", scope: !222, file: !10, line: 682, baseType: !208, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dofus_stage", scope: !222, file: !10, line: 685, baseType: !208, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fiesta_stage", scope: !222, file: !10, line: 688, baseType: !208, size: 2, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "wow_stage", scope: !222, file: !10, line: 691, baseType: !208, size: 2, offset: 587, flags: DIFlagBitField, extraData: i64 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "veoh_tv_stage", scope: !222, file: !10, line: 694, baseType: !208, size: 2, offset: 589, flags: DIFlagBitField, extraData: i64 576)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "shoutcast_stage", scope: !222, file: !10, line: 697, baseType: !208, size: 2, offset: 591, flags: DIFlagBitField, extraData: i64 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_special_packets_seen", scope: !222, file: !10, line: 700, baseType: !208, size: 1, offset: 593, flags: DIFlagBitField, extraData: i64 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mail_pop_stage", scope: !222, file: !10, line: 703, baseType: !208, size: 2, offset: 594, flags: DIFlagBitField, extraData: i64 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mail_imap_stage", scope: !222, file: !10, line: 706, baseType: !208, size: 3, offset: 596, flags: DIFlagBitField, extraData: i64 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mail_imap_starttls", scope: !222, file: !10, line: 706, baseType: !208, size: 2, offset: 599, flags: DIFlagBitField, extraData: i64 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "skype_packet_id", scope: !222, file: !10, line: 709, baseType: !199, size: 8, offset: 608)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "citrix_packet_id", scope: !222, file: !10, line: 712, baseType: !199, size: 8, offset: 616)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lotus_notes_packet_id", scope: !222, file: !10, line: 715, baseType: !199, size: 8, offset: 624)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "teamviewer_stage", scope: !222, file: !10, line: 718, baseType: !199, size: 8, offset: 632)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prev_zmq_pkt_len", scope: !222, file: !10, line: 721, baseType: !199, size: 8, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prev_zmq_pkt", scope: !222, file: !10, line: 722, baseType: !300, size: 80, offset: 648)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 80, elements: !303)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !182, line: 33, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !133, line: 30, baseType: !134)
!303 = !{!304}
!304 = !DISubrange(count: 10)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ppstream_stage", scope: !222, file: !10, line: 725, baseType: !208, size: 3, offset: 728, flags: DIFlagBitField, extraData: i64 728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "memcached_matches", scope: !222, file: !10, line: 728, baseType: !199, size: 8, offset: 736)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nest_log_sink_matches", scope: !222, file: !10, line: 731, baseType: !199, size: 8, offset: 744)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !219, file: !10, line: 1158, baseType: !309, size: 288)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_flow_udp_struct", file: !10, line: 736, size: 288, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "snmp_msg_id", scope: !309, file: !10, line: 738, baseType: !208, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "snmp_stage", scope: !309, file: !10, line: 741, baseType: !208, size: 2, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ppstream_stage", scope: !309, file: !10, line: 744, baseType: !208, size: 3, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "halflife2_stage", scope: !309, file: !10, line: 747, baseType: !208, size: 2, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tftp_stage", scope: !309, file: !10, line: 750, baseType: !208, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "aimini_stage", scope: !309, file: !10, line: 753, baseType: !208, size: 5, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "xbox_stage", scope: !309, file: !10, line: 756, baseType: !208, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wsus_stage", scope: !309, file: !10, line: 759, baseType: !208, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "skype_packet_id", scope: !309, file: !10, line: 762, baseType: !199, size: 8, offset: 48)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "teamviewer_stage", scope: !309, file: !10, line: 765, baseType: !199, size: 8, offset: 56)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "eaq_pkt_id", scope: !309, file: !10, line: 768, baseType: !199, size: 8, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "eaq_sequence", scope: !309, file: !10, line: 769, baseType: !208, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rx_conn_epoch", scope: !309, file: !10, line: 772, baseType: !208, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rx_conn_id", scope: !309, file: !10, line: 773, baseType: !208, size: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "memcached_matches", scope: !309, file: !10, line: 776, baseType: !199, size: 8, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "wireguard_stage", scope: !309, file: !10, line: 779, baseType: !199, size: 8, offset: 200)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "wireguard_peer_index", scope: !309, file: !10, line: 780, baseType: !207, size: 64, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flow_extra_info", scope: !189, file: !10, line: 1162, baseType: !329, size: 128, offset: 1088)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 128, elements: !331)
!330 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!331 = !{!332}
!332 = !DISubrange(count: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "server_id", scope: !189, file: !10, line: 1168, baseType: !334, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_id_struct", file: !10, line: 498, size: 1856, elements: !336)
!336 = !{!337, !344, !371, !372, !373, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "detected_protocol_bitmask", scope: !335, file: !10, line: 505, baseType: !338, size: 512)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ndpi_protocol_bitmask_struct_t", file: !10, line: 106, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_protocol_bitmask_struct", file: !10, line: 104, size: 512, elements: !340)
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !339, file: !10, line: 105, baseType: !342, size: 512)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 512, elements: !331)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ndpi_ndpi_mask", file: !10, line: 101, baseType: !208)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rtsp_ip_address", scope: !335, file: !10, line: 507, baseType: !345, size: 128, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ndpi_ip_addr_t", file: !10, line: 375, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !10, line: 368, size: 128, elements: !347)
!347 = !{!348, !349, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !346, file: !10, line: 370, baseType: !208, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_u_int8_t", scope: !346, file: !10, line: 371, baseType: !350, size: 32)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 32, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 4)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !346, file: !10, line: 373, baseType: !354, size: 128)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_in6_addr", file: !10, line: 302, size: 128, elements: !355)
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr", scope: !354, file: !10, line: 308, baseType: !357, size: 128)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !354, file: !10, line: 303, size: 128, elements: !358)
!358 = !{!359, !361, !365, !367}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !357, file: !10, line: 304, baseType: !360, size: 128)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 128, elements: !331)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !357, file: !10, line: 305, baseType: !362, size: 128)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 8)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !357, file: !10, line: 306, baseType: !366, size: 128)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 128, elements: !351)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr64", scope: !357, file: !10, line: 307, baseType: !368, size: 128)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 128, elements: !160)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int64_t", file: !182, line: 181, baseType: !370)
!370 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "yahoo_video_lan_timer", scope: !335, file: !10, line: 510, baseType: !208, size: 32, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "irc_port", scope: !335, file: !10, line: 515, baseType: !362, size: 128, offset: 672)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "last_time_port_used", scope: !335, file: !10, line: 516, baseType: !374, size: 256, offset: 800)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, elements: !363)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "irc_ts", scope: !335, file: !10, line: 517, baseType: !208, size: 32, offset: 1056)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gnutella_ts", scope: !335, file: !10, line: 520, baseType: !208, size: 32, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "thunder_ts", scope: !335, file: !10, line: 523, baseType: !208, size: 32, offset: 1120)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rtsp_timer", scope: !335, file: !10, line: 526, baseType: !208, size: 32, offset: 1152)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "zattoo_ts", scope: !335, file: !10, line: 529, baseType: !208, size: 32, offset: 1184)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "jabber_stun_or_ft_ts", scope: !335, file: !10, line: 532, baseType: !208, size: 32, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "directconnect_last_safe_access_time", scope: !335, file: !10, line: 535, baseType: !208, size: 32, offset: 1248)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "soulseek_last_safe_access_time", scope: !335, file: !10, line: 538, baseType: !208, size: 32, offset: 1280)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "detected_directconnect_port", scope: !335, file: !10, line: 541, baseType: !181, size: 16, offset: 1312)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "detected_directconnect_udp_port", scope: !335, file: !10, line: 542, baseType: !181, size: 16, offset: 1328)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "detected_directconnect_ssl_port", scope: !335, file: !10, line: 543, baseType: !181, size: 16, offset: 1344)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bt_port_t", scope: !335, file: !10, line: 547, baseType: !362, size: 128, offset: 1360)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bt_port_u", scope: !335, file: !10, line: 548, baseType: !362, size: 128, offset: 1488)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "jabber_voice_stun_port", scope: !335, file: !10, line: 552, baseType: !389, size: 96, offset: 1616)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 96, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 6)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jabber_file_transfer_port", scope: !335, file: !10, line: 553, baseType: !192, size: 32, offset: 1712)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "detected_gnutella_port", scope: !335, file: !10, line: 556, baseType: !181, size: 16, offset: 1744)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "detected_gnutella_udp_port1", scope: !335, file: !10, line: 559, baseType: !181, size: 16, offset: 1760)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "detected_gnutella_udp_port2", scope: !335, file: !10, line: 560, baseType: !181, size: 16, offset: 1776)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "soulseek_listen_port", scope: !335, file: !10, line: 563, baseType: !181, size: 16, offset: 1792)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "irc_number_of_port", scope: !335, file: !10, line: 566, baseType: !199, size: 8, offset: 1808)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "jabber_voice_stun_used_ports", scope: !335, file: !10, line: 569, baseType: !199, size: 8, offset: 1816)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "yahoo_video_lan_dir", scope: !335, file: !10, line: 573, baseType: !208, size: 1, offset: 1824, flags: DIFlagBitField, extraData: i64 1824)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "yahoo_conf_logged_in", scope: !335, file: !10, line: 576, baseType: !208, size: 1, offset: 1825, flags: DIFlagBitField, extraData: i64 1824)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "yahoo_voice_conf_logged_in", scope: !335, file: !10, line: 577, baseType: !208, size: 1, offset: 1826, flags: DIFlagBitField, extraData: i64 1824)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rtsp_ts_set", scope: !335, file: !10, line: 580, baseType: !208, size: 1, offset: 1827, flags: DIFlagBitField, extraData: i64 1824)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "host_server_name", scope: !189, file: !10, line: 1170, baseType: !404, size: 1920, offset: 1280)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 1920, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 240)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "initial_binary_bytes", scope: !189, file: !10, line: 1171, baseType: !408, size: 64, offset: 3200)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 64, elements: !363)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "initial_binary_bytes_len", scope: !189, file: !10, line: 1171, baseType: !199, size: 8, offset: 3264)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "risk_checked", scope: !189, file: !10, line: 1172, baseType: !199, size: 8, offset: 3272)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "risk", scope: !189, file: !10, line: 1173, baseType: !208, size: 32, offset: 3296)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "http", scope: !189, file: !10, line: 1188, baseType: !413, size: 320, offset: 3328)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !10, line: 1182, size: 320, elements: !414)
!414 = !{!415, !417, !419, !420, !421, !422, !423, !424}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !413, file: !10, line: 1183, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ndpi_http_method", file: !10, line: 486, baseType: !50)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !413, file: !10, line: 1184, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !413, file: !10, line: 1184, baseType: !418, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !413, file: !10, line: 1184, baseType: !418, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_request_headers", scope: !413, file: !10, line: 1185, baseType: !199, size: 8, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_response_headers", scope: !413, file: !10, line: 1185, baseType: !199, size: 8, offset: 264)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "request_version", scope: !413, file: !10, line: 1186, baseType: !199, size: 8, offset: 272)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "response_status_code", scope: !413, file: !10, line: 1187, baseType: !181, size: 16, offset: 288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "kerberos_buf", scope: !189, file: !10, line: 1198, baseType: !426, size: 128, offset: 3648)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !10, line: 1195, size: 128, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pktbuf", scope: !426, file: !10, line: 1196, baseType: !418, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pktbuf_maxlen", scope: !426, file: !10, line: 1197, baseType: !181, size: 16, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pktbuf_currlen", scope: !426, file: !10, line: 1197, baseType: !181, size: 16, offset: 80)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "protos", scope: !189, file: !10, line: 1287, baseType: !432, size: 1856, offset: 3776)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !10, line: 1200, size: 1856, elements: !433)
!433 = !{!434, !445, !450, !459, !501, !508, !513, !527, !534, !538, !547, !555, !560}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dns", scope: !432, file: !10, line: 1206, baseType: !435, size: 224)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1202, size: 224, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "num_queries", scope: !435, file: !10, line: 1203, baseType: !199, size: 8)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "num_answers", scope: !435, file: !10, line: 1203, baseType: !199, size: 8, offset: 8)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reply_code", scope: !435, file: !10, line: 1203, baseType: !199, size: 8, offset: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "is_query", scope: !435, file: !10, line: 1203, baseType: !199, size: 8, offset: 24)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "query_type", scope: !435, file: !10, line: 1204, baseType: !181, size: 16, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "query_class", scope: !435, file: !10, line: 1204, baseType: !181, size: 16, offset: 48)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rsp_type", scope: !435, file: !10, line: 1204, baseType: !181, size: 16, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rsp_addr", scope: !435, file: !10, line: 1205, baseType: !345, size: 128, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ntp", scope: !432, file: !10, line: 1211, baseType: !446, size: 16)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1208, size: 16, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "request_code", scope: !446, file: !10, line: 1209, baseType: !199, size: 8)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !446, file: !10, line: 1210, baseType: !199, size: 8, offset: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "kerberos", scope: !432, file: !10, line: 1215, baseType: !451, size: 1152)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1213, size: 1152, elements: !452)
!452 = !{!453, !457, !458}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !451, file: !10, line: 1214, baseType: !454, size: 384)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 384, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 48)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !451, file: !10, line: 1214, baseType: !454, size: 384, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !451, file: !10, line: 1214, baseType: !454, size: 384, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "stun_ssl", scope: !432, file: !10, line: 1239, baseType: !460, size: 1856)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1217, size: 1856, elements: !461)
!461 = !{!462, !495}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !460, file: !10, line: 1232, baseType: !463, size: 1792)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !10, line: 1218, size: 1792, elements: !464)
!464 = !{!465, !469, !470, !471, !475, !476, !477, !478, !479, !480, !481, !482, !486, !487, !488, !493}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_version_str", scope: !463, file: !10, line: 1219, baseType: !466, size: 96)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 96, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 12)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_version", scope: !463, file: !10, line: 1220, baseType: !181, size: 16, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "server_names_len", scope: !463, file: !10, line: 1220, baseType: !181, size: 16, offset: 112)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "client_requested_server_name", scope: !463, file: !10, line: 1221, baseType: !472, size: 512, offset: 128)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 512, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "server_names", scope: !463, file: !10, line: 1221, baseType: !418, size: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "alpn", scope: !463, file: !10, line: 1222, baseType: !418, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tls_supported_versions", scope: !463, file: !10, line: 1222, baseType: !418, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "issuerDN", scope: !463, file: !10, line: 1222, baseType: !418, size: 64, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "subjectDN", scope: !463, file: !10, line: 1222, baseType: !418, size: 64, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "notBefore", scope: !463, file: !10, line: 1223, baseType: !208, size: 32, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "notAfter", scope: !463, file: !10, line: 1223, baseType: !208, size: 32, offset: 992)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ja3_client", scope: !463, file: !10, line: 1224, baseType: !483, size: 264, offset: 1024)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 264, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 33)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ja3_server", scope: !463, file: !10, line: 1224, baseType: !483, size: 264, offset: 1288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "server_cipher", scope: !463, file: !10, line: 1225, baseType: !181, size: 16, offset: 1552)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted_sni", scope: !463, file: !10, line: 1230, baseType: !489, size: 128, offset: 1600)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !10, line: 1227, size: 128, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_suite", scope: !489, file: !10, line: 1228, baseType: !181, size: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "esni", scope: !489, file: !10, line: 1229, baseType: !418, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "server_unsafe_cipher", scope: !463, file: !10, line: 1231, baseType: !494, size: 32, offset: 1728)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ndpi_cipher_weakness", file: !10, line: 1124, baseType: !62)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "stun", scope: !460, file: !10, line: 1236, baseType: !496, size: 24, offset: 1792)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !10, line: 1234, size: 24, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "num_udp_pkts", scope: !496, file: !10, line: 1235, baseType: !199, size: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "num_processed_pkts", scope: !496, file: !10, line: 1235, baseType: !199, size: 8, offset: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "num_binding_requests", scope: !496, file: !10, line: 1235, baseType: !199, size: 8, offset: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ssh", scope: !432, file: !10, line: 1244, baseType: !502, size: 1296)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1241, size: 1296, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "client_signature", scope: !502, file: !10, line: 1242, baseType: !454, size: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "server_signature", scope: !502, file: !10, line: 1242, baseType: !454, size: 384, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "hassh_client", scope: !502, file: !10, line: 1243, baseType: !483, size: 264, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hassh_server", scope: !502, file: !10, line: 1243, baseType: !483, size: 264, offset: 1032)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "imo", scope: !432, file: !10, line: 1248, baseType: !509, size: 16)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1246, size: 16, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "last_one_byte_pkt", scope: !509, file: !10, line: 1247, baseType: !199, size: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "last_byte", scope: !509, file: !10, line: 1247, baseType: !199, size: 8, offset: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "telnet", scope: !432, file: !10, line: 1256, baseType: !514, size: 528)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1250, size: 528, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !526}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "username_detected", scope: !514, file: !10, line: 1251, baseType: !199, size: 1, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "username_found", scope: !514, file: !10, line: 1251, baseType: !199, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "password_detected", scope: !514, file: !10, line: 1252, baseType: !199, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "password_found", scope: !514, file: !10, line: 1252, baseType: !199, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !514, file: !10, line: 1253, baseType: !199, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "character_id", scope: !514, file: !10, line: 1254, baseType: !199, size: 8, offset: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !514, file: !10, line: 1255, baseType: !523, size: 256, offset: 16)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 256, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !514, file: !10, line: 1255, baseType: !523, size: 256, offset: 272)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mdns", scope: !432, file: !10, line: 1260, baseType: !528, size: 768)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1258, size: 768, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "answer", scope: !528, file: !10, line: 1259, baseType: !531, size: 768)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 768, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ubntac2", scope: !432, file: !10, line: 1264, baseType: !535, size: 256)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1262, size: 256, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !535, file: !10, line: 1263, baseType: !523, size: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "http", scope: !432, file: !10, line: 1271, baseType: !539, size: 448)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1266, size: 448, elements: !540)
!540 = !{!541, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "detected_os", scope: !539, file: !10, line: 1268, baseType: !542, size: 256)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 256, elements: !524)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nat_ip", scope: !539, file: !10, line: 1270, baseType: !544, size: 192, offset: 256)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 192, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 24)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_imap_pop_smtp", scope: !432, file: !10, line: 1276, baseType: !548, size: 264)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1273, size: 264, elements: !549)
!549 = !{!550, !551, !552, !553, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "auth_found", scope: !548, file: !10, line: 1274, baseType: !199, size: 1, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failed", scope: !548, file: !10, line: 1274, baseType: !199, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !548, file: !10, line: 1274, baseType: !199, size: 5, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !548, file: !10, line: 1275, baseType: !329, size: 128, offset: 8)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !548, file: !10, line: 1275, baseType: !329, size: 128, offset: 136)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bittorrent", scope: !432, file: !10, line: 1281, baseType: !556, size: 160)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1278, size: 160, elements: !557)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !556, file: !10, line: 1280, baseType: !559, size: 160)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 160, elements: !277)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dhcp", scope: !432, file: !10, line: 1286, baseType: !561, size: 768)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !10, line: 1283, size: 768, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !561, file: !10, line: 1284, baseType: !454, size: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "class_ident", scope: !561, file: !10, line: 1285, baseType: !454, size: 384, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_protocol_bitmask", scope: !189, file: !10, line: 1292, baseType: !338, size: 512, offset: 5632)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !189, file: !10, line: 1294, baseType: !185, size: 32, offset: 6144)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "redis_s2d_first_char", scope: !189, file: !10, line: 1297, baseType: !199, size: 8, offset: 6176)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "redis_d2s_first_char", scope: !189, file: !10, line: 1297, baseType: !199, size: 8, offset: 6184)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "packet_counter", scope: !189, file: !10, line: 1299, baseType: !181, size: 16, offset: 6192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "packet_direction_counter", scope: !189, file: !10, line: 1300, baseType: !192, size: 32, offset: 6208)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "byte_counter", scope: !189, file: !10, line: 1301, baseType: !192, size: 32, offset: 6240)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "bittorrent_stage", scope: !189, file: !10, line: 1303, baseType: !199, size: 8, offset: 6272)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "directconnect_stage", scope: !189, file: !10, line: 1306, baseType: !199, size: 2, offset: 6280, flags: DIFlagBitField, extraData: i64 6280)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sip_yahoo_voice", scope: !189, file: !10, line: 1309, baseType: !199, size: 1, offset: 6282, flags: DIFlagBitField, extraData: i64 6280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "http_detected", scope: !189, file: !10, line: 1312, baseType: !199, size: 1, offset: 6283, flags: DIFlagBitField, extraData: i64 6280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rtsprdt_stage", scope: !189, file: !10, line: 1315, baseType: !199, size: 2, offset: 6284, flags: DIFlagBitField, extraData: i64 6280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rtsp_control_flow", scope: !189, file: !10, line: 1315, baseType: !199, size: 1, offset: 6286, flags: DIFlagBitField, extraData: i64 6280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "yahoo_detection_finished", scope: !189, file: !10, line: 1318, baseType: !199, size: 2, offset: 6288, flags: DIFlagBitField, extraData: i64 6288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "zattoo_stage", scope: !189, file: !10, line: 1321, baseType: !199, size: 3, offset: 6290, flags: DIFlagBitField, extraData: i64 6288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "qq_stage", scope: !189, file: !10, line: 1324, baseType: !199, size: 3, offset: 6293, flags: DIFlagBitField, extraData: i64 6288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "thunder_stage", scope: !189, file: !10, line: 1327, baseType: !199, size: 2, offset: 6296, flags: DIFlagBitField, extraData: i64 6288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "florensia_stage", scope: !189, file: !10, line: 1330, baseType: !199, size: 1, offset: 6298, flags: DIFlagBitField, extraData: i64 6288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "socks5_stage", scope: !189, file: !10, line: 1333, baseType: !199, size: 2, offset: 6299, flags: DIFlagBitField, extraData: i64 6288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "socks4_stage", scope: !189, file: !10, line: 1333, baseType: !199, size: 2, offset: 6301, flags: DIFlagBitField, extraData: i64 6288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "edonkey_stage", scope: !189, file: !10, line: 1336, baseType: !199, size: 2, offset: 6304, flags: DIFlagBitField, extraData: i64 6304)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_control_stage", scope: !189, file: !10, line: 1339, baseType: !199, size: 2, offset: 6306, flags: DIFlagBitField, extraData: i64 6304)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rtmp_stage", scope: !189, file: !10, line: 1342, baseType: !199, size: 2, offset: 6308, flags: DIFlagBitField, extraData: i64 6304)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pando_stage", scope: !189, file: !10, line: 1345, baseType: !199, size: 3, offset: 6312, flags: DIFlagBitField, extraData: i64 6312)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "steam_stage", scope: !189, file: !10, line: 1348, baseType: !181, size: 3, offset: 6315, flags: DIFlagBitField, extraData: i64 6312)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "steam_stage1", scope: !189, file: !10, line: 1348, baseType: !181, size: 3, offset: 6320, flags: DIFlagBitField, extraData: i64 6320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "steam_stage2", scope: !189, file: !10, line: 1348, baseType: !181, size: 2, offset: 6323, flags: DIFlagBitField, extraData: i64 6320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "steam_stage3", scope: !189, file: !10, line: 1348, baseType: !181, size: 2, offset: 6325, flags: DIFlagBitField, extraData: i64 6320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pplive_stage1", scope: !189, file: !10, line: 1351, baseType: !199, size: 3, offset: 6328, flags: DIFlagBitField, extraData: i64 6328)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pplive_stage2", scope: !189, file: !10, line: 1351, baseType: !199, size: 2, offset: 6331, flags: DIFlagBitField, extraData: i64 6328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pplive_stage3", scope: !189, file: !10, line: 1351, baseType: !199, size: 2, offset: 6333, flags: DIFlagBitField, extraData: i64 6328)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "starcraft_udp_stage", scope: !189, file: !10, line: 1354, baseType: !199, size: 3, offset: 6336, flags: DIFlagBitField, extraData: i64 6336)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ovpn_session_id", scope: !189, file: !10, line: 1357, baseType: !408, size: 64, offset: 6344)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ovpn_counter", scope: !189, file: !10, line: 1358, baseType: !199, size: 8, offset: 6408)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tinc_state", scope: !189, file: !10, line: 1361, baseType: !199, size: 8, offset: 6416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tinc_cache_entry", scope: !189, file: !10, line: 1362, baseType: !601, size: 80, offset: 6424)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tinc_cache_entry", file: !10, line: 469, size: 80, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "src_address", scope: !601, file: !10, line: 470, baseType: !208, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dst_address", scope: !601, file: !10, line: 471, baseType: !208, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !601, file: !10, line: 472, baseType: !181, size: 16, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "csgo_strid", scope: !189, file: !10, line: 1365, baseType: !607, size: 144, offset: 6504)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 144, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 18)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "csgo_state", scope: !189, file: !10, line: 1365, baseType: !199, size: 8, offset: 6648)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "csgo_s2", scope: !189, file: !10, line: 1365, baseType: !199, size: 8, offset: 6656)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "csgo_id2", scope: !189, file: !10, line: 1366, baseType: !208, size: 32, offset: 6688)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !189, file: !10, line: 1369, baseType: !614, size: 11072, offset: 6720)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_packet_struct", file: !10, line: 790, size: 11072, elements: !615)
!615 = !{!616, !632, !646, !668, !677, !680, !681, !682, !683, !685, !686, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "iph", scope: !614, file: !10, line: 791, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_iphdr", file: !10, line: 279, size: 160, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !619, file: !10, line: 281, baseType: !199, size: 4, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !619, file: !10, line: 281, baseType: !199, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !619, file: !10, line: 287, baseType: !199, size: 8, offset: 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !619, file: !10, line: 288, baseType: !181, size: 16, offset: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !619, file: !10, line: 289, baseType: !181, size: 16, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !619, file: !10, line: 290, baseType: !181, size: 16, offset: 48)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !619, file: !10, line: 291, baseType: !199, size: 8, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !619, file: !10, line: 292, baseType: !199, size: 8, offset: 72)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !619, file: !10, line: 293, baseType: !181, size: 16, offset: 80)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !619, file: !10, line: 294, baseType: !208, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !619, file: !10, line: 295, baseType: !208, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "iphv6", scope: !614, file: !10, line: 793, baseType: !633, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_ipv6hdr", file: !10, line: 320, size: 320, elements: !636)
!636 = !{!637, !644, !645}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_hdr", scope: !635, file: !10, line: 321, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_ip6_hdrctl", file: !10, line: 312, size: 64, elements: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_flow", scope: !638, file: !10, line: 313, baseType: !208, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_plen", scope: !638, file: !10, line: 314, baseType: !181, size: 16, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_nxt", scope: !638, file: !10, line: 315, baseType: !199, size: 8, offset: 48)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_un1_hlim", scope: !638, file: !10, line: 316, baseType: !199, size: 8, offset: 56)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_src", scope: !635, file: !10, line: 322, baseType: !354, size: 128, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ip6_dst", scope: !635, file: !10, line: 323, baseType: !354, size: 128, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !614, file: !10, line: 795, baseType: !647, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_tcphdr", file: !10, line: 329, size: 160, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !649, file: !10, line: 331, baseType: !181, size: 16)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !649, file: !10, line: 332, baseType: !181, size: 16, offset: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !649, file: !10, line: 333, baseType: !208, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !649, file: !10, line: 334, baseType: !208, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !649, file: !10, line: 336, baseType: !181, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !649, file: !10, line: 336, baseType: !181, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !649, file: !10, line: 336, baseType: !181, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !649, file: !10, line: 342, baseType: !181, size: 16, offset: 112)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !649, file: !10, line: 343, baseType: !181, size: 16, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !649, file: !10, line: 344, baseType: !181, size: 16, offset: 144)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !614, file: !10, line: 796, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_udphdr", file: !10, line: 350, size: 64, elements: !672)
!672 = !{!673, !674, !675, !676}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !671, file: !10, line: 352, baseType: !181, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !671, file: !10, line: 353, baseType: !181, size: 16, offset: 16)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !671, file: !10, line: 354, baseType: !181, size: 16, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !671, file: !10, line: 355, baseType: !181, size: 16, offset: 48)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "generic_l4_ptr", scope: !614, file: !10, line: 797, baseType: !678, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !614, file: !10, line: 798, baseType: !678, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "current_time_ms", scope: !614, file: !10, line: 800, baseType: !369, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "detected_protocol_stack", scope: !614, file: !10, line: 802, baseType: !192, size: 32, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "detected_subprotocol_stack", scope: !614, file: !10, line: 803, baseType: !684, size: 16, offset: 480)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 16, elements: !160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_stack_info", scope: !614, file: !10, line: 804, baseType: !181, size: 16, offset: 496)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !614, file: !10, line: 806, baseType: !687, size: 8192, offset: 512)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 8192, elements: !473)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndpi_int_one_line_struct", file: !10, line: 785, size: 128, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !688, file: !10, line: 786, baseType: !678, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !688, file: !10, line: 787, baseType: !181, size: 16, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "host_line", scope: !614, file: !10, line: 808, baseType: !688, size: 128, offset: 8704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "forwarded_line", scope: !614, file: !10, line: 809, baseType: !688, size: 128, offset: 8832)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "referer_line", scope: !614, file: !10, line: 810, baseType: !688, size: 128, offset: 8960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "content_line", scope: !614, file: !10, line: 811, baseType: !688, size: 128, offset: 9088)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "content_disposition_line", scope: !614, file: !10, line: 812, baseType: !688, size: 128, offset: 9216)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "accept_line", scope: !614, file: !10, line: 813, baseType: !688, size: 128, offset: 9344)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_line", scope: !614, file: !10, line: 814, baseType: !688, size: 128, offset: 9472)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "http_url_name", scope: !614, file: !10, line: 815, baseType: !688, size: 128, offset: 9600)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "http_encoding", scope: !614, file: !10, line: 816, baseType: !688, size: 128, offset: 9728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "http_transfer_encoding", scope: !614, file: !10, line: 817, baseType: !688, size: 128, offset: 9856)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "http_contentlen", scope: !614, file: !10, line: 818, baseType: !688, size: 128, offset: 9984)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "http_cookie", scope: !614, file: !10, line: 819, baseType: !688, size: 128, offset: 10112)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "http_origin", scope: !614, file: !10, line: 820, baseType: !688, size: 128, offset: 10240)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "http_x_session_type", scope: !614, file: !10, line: 821, baseType: !688, size: 128, offset: 10368)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "server_line", scope: !614, file: !10, line: 822, baseType: !688, size: 128, offset: 10496)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "http_method", scope: !614, file: !10, line: 823, baseType: !688, size: 128, offset: 10624)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "http_response", scope: !614, file: !10, line: 824, baseType: !688, size: 128, offset: 10752)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "http_num_headers", scope: !614, file: !10, line: 826, baseType: !199, size: 8, offset: 10880)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "l3_packet_len", scope: !614, file: !10, line: 828, baseType: !181, size: 16, offset: 10896)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "l4_packet_len", scope: !614, file: !10, line: 829, baseType: !181, size: 16, offset: 10912)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "payload_packet_len", scope: !614, file: !10, line: 830, baseType: !181, size: 16, offset: 10928)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "actual_payload_len", scope: !614, file: !10, line: 831, baseType: !181, size: 16, offset: 10944)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "num_retried_bytes", scope: !614, file: !10, line: 832, baseType: !181, size: 16, offset: 10960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_lines", scope: !614, file: !10, line: 833, baseType: !181, size: 16, offset: 10976)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_unix_lines", scope: !614, file: !10, line: 834, baseType: !181, size: 16, offset: 10992)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "empty_line_position", scope: !614, file: !10, line: 835, baseType: !181, size: 16, offset: 11008)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_retransmission", scope: !614, file: !10, line: 836, baseType: !199, size: 8, offset: 11024)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !614, file: !10, line: 837, baseType: !199, size: 8, offset: 11032)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tls_certificate_detected", scope: !614, file: !10, line: 839, baseType: !199, size: 4, offset: 11040, flags: DIFlagBitField, extraData: i64 11040)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tls_certificate_num_checks", scope: !614, file: !10, line: 839, baseType: !199, size: 4, offset: 11044, flags: DIFlagBitField, extraData: i64 11040)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "packet_lines_parsed_complete", scope: !614, file: !10, line: 840, baseType: !199, size: 1, offset: 11048, flags: DIFlagBitField, extraData: i64 11040)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "packet_direction", scope: !614, file: !10, line: 841, baseType: !199, size: 1, offset: 11049, flags: DIFlagBitField, extraData: i64 11040)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "empty_line_position_set", scope: !614, file: !10, line: 841, baseType: !199, size: 1, offset: 11050, flags: DIFlagBitField, extraData: i64 11040)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !614, file: !10, line: 841, baseType: !199, size: 5, offset: 11051, flags: DIFlagBitField, extraData: i64 11040)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !189, file: !10, line: 1370, baseType: !188, size: 64, offset: 17792)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !189, file: !10, line: 1371, baseType: !334, size: 64, offset: 17856)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !189, file: !10, line: 1372, baseType: !334, size: 64, offset: 17920)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ndpi_src", scope: !127, file: !3, line: 75, baseType: !334, size: 64, offset: 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ndpi_dst", scope: !127, file: !3, line: 76, baseType: !334, size: 64, offset: 1088)
!731 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !734, line: 163, size: 112, elements: !735)
!734 = !DIFile(filename: "./include/linux/if_ether.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!735 = !{!736, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !733, file: !734, line: 164, baseType: !737, size: 48)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 48, elements: !390)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !733, file: !734, line: 165, baseType: !737, size: 48, offset: 48)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !733, file: !734, line: 166, baseType: !740, size: 16, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !741, line: 25, baseType: !742)
!741 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !120, line: 24, baseType: !167)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !745, line: 44, size: 160, elements: !746)
!745 = !DIFile(filename: "/usr/include/netinet/ip.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !744, file: !745, line: 47, baseType: !121, size: 4, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !744, file: !745, line: 48, baseType: !121, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !744, file: !745, line: 55, baseType: !130, size: 8, offset: 8)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !744, file: !745, line: 56, baseType: !165, size: 16, offset: 16)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !744, file: !745, line: 57, baseType: !165, size: 16, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !744, file: !745, line: 58, baseType: !165, size: 16, offset: 48)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !744, file: !745, line: 59, baseType: !130, size: 8, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !744, file: !745, line: 60, baseType: !130, size: 8, offset: 72)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !744, file: !745, line: 61, baseType: !165, size: 16, offset: 80)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !744, file: !745, line: 62, baseType: !136, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !744, file: !745, line: 63, baseType: !136, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !760, line: 87, size: 160, elements: !761)
!760 = !DIFile(filename: "/usr/include/netinet/tcp.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, scope: !759, file: !760, line: 89, baseType: !763, size: 160)
!763 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !759, file: !760, line: 89, size: 160, elements: !764)
!764 = !{!765, !779}
!765 = !DIDerivedType(tag: DW_TAG_member, scope: !763, file: !760, line: 91, baseType: !766, size: 160)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !763, file: !760, line: 91, size: 160, elements: !767)
!767 = !{!768, !769, !770, !772, !773, !774, !775, !776, !777, !778}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "th_sport", scope: !766, file: !760, line: 93, baseType: !165, size: 16)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "th_dport", scope: !766, file: !760, line: 94, baseType: !165, size: 16, offset: 16)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "th_seq", scope: !766, file: !760, line: 95, baseType: !771, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_seq", file: !760, line: 82, baseType: !136)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "th_ack", scope: !766, file: !760, line: 96, baseType: !771, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "th_x2", scope: !766, file: !760, line: 98, baseType: !130, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "th_off", scope: !766, file: !760, line: 99, baseType: !130, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "th_flags", scope: !766, file: !760, line: 105, baseType: !130, size: 8, offset: 104)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "th_win", scope: !766, file: !760, line: 112, baseType: !165, size: 16, offset: 112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "th_sum", scope: !766, file: !760, line: 113, baseType: !165, size: 16, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "th_urp", scope: !766, file: !760, line: 114, baseType: !165, size: 16, offset: 144)
!779 = !DIDerivedType(tag: DW_TAG_member, scope: !763, file: !760, line: 116, baseType: !780, size: 160)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !763, file: !760, line: 116, size: 160, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !780, file: !760, line: 118, baseType: !165, size: 16)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !780, file: !760, line: 119, baseType: !165, size: 16, offset: 16)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !780, file: !760, line: 120, baseType: !136, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !780, file: !760, line: 121, baseType: !136, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !780, file: !760, line: 123, baseType: !165, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !780, file: !760, line: 124, baseType: !165, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !780, file: !760, line: 125, baseType: !165, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !780, file: !760, line: 126, baseType: !165, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !780, file: !760, line: 127, baseType: !165, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !780, file: !760, line: 128, baseType: !165, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !780, file: !760, line: 129, baseType: !165, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !780, file: !760, line: 130, baseType: !165, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "res2", scope: !780, file: !760, line: 131, baseType: !165, size: 2, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !780, file: !760, line: 145, baseType: !165, size: 16, offset: 112)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !780, file: !760, line: 146, baseType: !165, size: 16, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !780, file: !760, line: 147, baseType: !165, size: 16, offset: 144)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_opt", file: !68, line: 152, size: 32, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !803, file: !68, line: 153, baseType: !130, size: 8)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !803, file: !68, line: 154, baseType: !130, size: 8, offset: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !803, file: !68, line: 155, baseType: !165, size: 16, offset: 16)
!808 = !{!0, !809, !821, !823, !825, !827, !829, !831, !834, !841, !846, !851, !853, !858}
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "HK_SOCK_MAP", scope: !2, file: !3, line: 80, type: !811, isLocal: false, isDefinition: true)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !812, line: 214, size: 224, elements: !813)
!812 = !DIFile(filename: "./include/bpf/bpf_helpers.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!813 = !{!814, !815, !816, !817, !818, !819, !820}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !811, file: !812, line: 215, baseType: !121, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !811, file: !812, line: 216, baseType: !121, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !811, file: !812, line: 217, baseType: !121, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !811, file: !812, line: 218, baseType: !121, size: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !811, file: !812, line: 219, baseType: !121, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !811, file: !812, line: 220, baseType: !121, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !811, file: !812, line: 221, baseType: !121, size: 32, offset: 192)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "APP_HASH_ID_MAP", scope: !2, file: !3, line: 87, type: !811, isLocal: false, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "TCP_STREAMS_CACHE_MAP", scope: !2, file: !3, line: 95, type: !811, isLocal: false, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "TCP_HOST_ROLE_MAP", scope: !2, file: !3, line: 102, type: !811, isLocal: false, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "PRFLNG_TRIES_NUM_MAP", scope: !2, file: !3, line: 109, type: !811, isLocal: false, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "SYN_HDR_INFO_MAP", scope: !2, file: !3, line: 116, type: !811, isLocal: false, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 498, type: !833, isLocal: false, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 32, elements: !351)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !812, line: 40, type: !836, isLocal: true, isDefinition: true)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!114, !839, !114, null}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "bpf_sock_ops_cb_flags_set", scope: !2, file: !812, line: 95, type: !843, isLocal: true, isDefinition: true)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!114, !125, !114}
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !812, line: 22, type: !848, isLocal: true, isDefinition: true)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!114, !125, !125, !125, !140}
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "bpf_sock_hash_update", scope: !2, file: !812, line: 104, type: !848, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !812, line: 20, type: !855, isLocal: true, isDefinition: true)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!125, !125, !125}
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "bpf_msg_redirect_hash", scope: !2, file: !812, line: 117, type: !860, isLocal: true, isDefinition: true)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!114, !125, !125, !125, !114}
!863 = !{i32 2, !"Dwarf Version", i32 4}
!864 = !{i32 2, !"Debug Info Version", i32 3}
!865 = !{i32 1, !"wchar_size", i32 4}
!866 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!867 = distinct !DISubprogram(name: "hooker_monitor_apps", scope: !3, file: !3, line: 170, type: !868, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !915)
!868 = !DISubroutineType(types: !869)
!869 = !{!114, !870}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock_ops", file: !73, line: 3009, size: 1472, elements: !872)
!872 = !{!873, !874, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !914}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !871, file: !73, line: 3010, baseType: !119, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, scope: !871, file: !73, line: 3011, baseType: !875, size: 128, offset: 32)
!875 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !871, file: !73, line: 3011, size: 128, elements: !876)
!876 = !{!877, !879, !880}
