; ModuleID = 'ingress_test_graft.c'
source_filename = "ingress_test_graft.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.vtl_hdr_t = type { i8, i32, i64, i16, i16 }

@xsks_map = global %struct.bpf_map_def { i32 17, i32 4, i32 4, i32 64, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !0
@NUM_ACK_MAP = global %struct.bpf_map_def { i32 2, i32 4, i32 2, i32 1, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !85
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !97
@vtl_csum.____fmt = private unnamed_addr constant [35 x i8] c"vtl_csum(): malformed ETH header.\0A\00", align 1
@vtl_csum.____fmt.1 = private unnamed_addr constant [34 x i8] c"vtl_csum(): malformed IP header.\0A\00", align 1
@vtl_csum.____fmt.2 = private unnamed_addr constant [35 x i8] c"vtl_csum(): malformed VTL header.\0A\00", align 1
@vtl_csum.____fmt.3 = private unnamed_addr constant [31 x i8] c"VTL layer: malformed payload.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xsks_map", scope: !2, file: !3, line: 16, type: !87, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !22, globals: !84)
!3 = !DIFile(filename: "ingress_test_graft.c", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2848, size: 32, elements: !7)
!6 = !DIFile(filename: "./include/linux/bpf.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!9 = !DIEnumerator(name: "XDP_DROP", value: 1)
!10 = !DIEnumerator(name: "XDP_PASS", value: 2)
!11 = !DIEnumerator(name: "XDP_TX", value: 3)
!12 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 66, size: 32, elements: !15)
!14 = !DIFile(filename: "./../include/vtl.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!15 = !{!16, !17, !18, !19, !20, !21}
!16 = !DIEnumerator(name: "NEGO", value: 0)
!17 = !DIEnumerator(name: "DATA", value: 1)
!18 = !DIEnumerator(name: "ACK", value: 2)
!19 = !DIEnumerator(name: "NACK", value: 3)
!20 = !DIEnumerator(name: "NEGO_ACK", value: 4)
!21 = !DIEnumerator(name: "NEGO_NACK", value: 5)
!22 = !{!23, !24, !25, !41, !65, !82, !83, !54}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !27, line: 163, size: 112, elements: !28)
!27 = !DIFile(filename: "./include/linux/if_ether.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!28 = !{!29, !34, !35}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !26, file: !27, line: 164, baseType: !30, size: 48)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 48, elements: !32)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33}
!33 = !DISubrange(count: 6)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !26, file: !27, line: 165, baseType: !30, size: 48, offset: 48)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !26, file: !27, line: 166, baseType: !36, size: 16, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !37, line: 25, baseType: !38)
!37 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !39, line: 24, baseType: !40)
!39 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !43, line: 44, size: 160, elements: !44)
!43 = !DIFile(filename: "/usr/include/netinet/ip.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!44 = !{!45, !47, !48, !53, !56, !57, !58, !59, !60, !61, !64}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !42, file: !43, line: 47, baseType: !46, size: 4, flags: DIFlagBitField, extraData: i64 0)
!46 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !42, file: !43, line: 48, baseType: !46, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !42, file: !43, line: 55, baseType: !49, size: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 24, baseType: !51)
!50 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !52, line: 37, baseType: !31)
!52 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !42, file: !43, line: 56, baseType: !54, size: 16, offset: 16)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !50, line: 25, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !52, line: 39, baseType: !40)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !42, file: !43, line: 57, baseType: !54, size: 16, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !42, file: !43, line: 58, baseType: !54, size: 16, offset: 48)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !42, file: !43, line: 59, baseType: !49, size: 8, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !42, file: !43, line: 60, baseType: !49, size: 8, offset: 72)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !42, file: !43, line: 61, baseType: !54, size: 16, offset: 80)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !42, file: !43, line: 62, baseType: !62, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !50, line: 26, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !52, line: 41, baseType: !46)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !42, file: !43, line: 63, baseType: !62, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "vtl_hdr_t", file: !14, line: 84, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 78, size: 192, elements: !68)
!68 = !{!69, !74, !76, !80, !81}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !67, file: !14, line: 79, baseType: !70, size: 8)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !71, line: 24, baseType: !72)
!71 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !52, line: 36, baseType: !73)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !67, file: !14, line: 80, baseType: !75, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "vtl_pkt_type", file: !14, line: 73, baseType: !13)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !67, file: !14, line: 81, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 62, baseType: !79)
!78 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !67, file: !14, line: 82, baseType: !54, size: 16, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !67, file: !14, line: 83, baseType: !54, size: 16, offset: 144)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!84 = !{!0, !85, !97, !103, !108, !116, !122, !127}
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "NUM_ACK_MAP", scope: !2, file: !3, line: 23, type: !87, isLocal: false, isDefinition: true)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !88, line: 214, size: 224, elements: !89)
!88 = !DIFile(filename: "./include/bpf/bpf_helpers.h", directory: "/home/vtl_server/vtlWorkspace/vtl_server/XTFsPool")
!89 = !{!90, !91, !92, !93, !94, !95, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !88, line: 215, baseType: !46, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !87, file: !88, line: 216, baseType: !46, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !87, file: !88, line: 217, baseType: !46, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !87, file: !88, line: 218, baseType: !46, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !87, file: !88, line: 219, baseType: !46, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !87, file: !88, line: 220, baseType: !46, size: 32, offset: 160)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !87, file: !88, line: 221, baseType: !46, size: 32, offset: 192)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 110, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 32, elements: !101)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!101 = !{!102}
!102 = !DISubrange(count: 4)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !88, line: 20, type: !105, isLocal: true, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!23, !23, !23}
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !88, line: 40, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !114, !113, null}
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !88, line: 22, type: !118, isLocal: true, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!113, !23, !23, !23, !121}
!121 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !88, line: 61, type: !124, isLocal: true, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!113, !23, !113, !113}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_tail", scope: !2, file: !88, line: 132, type: !129, isLocal: true, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!113, !23, !113}
!132 = !{i32 2, !"Dwarf Version", i32 4}
!133 = !{i32 2, !"Debug Info Version", i32 3}
!134 = !{i32 1, !"wchar_size", i32 4}
!135 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!136 = distinct !DISubprogram(name: "xdp_sock_prog", scope: !3, file: !3, line: 47, type: !137, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !148)
!137 = !DISubroutineType(types: !138)
!138 = !{!113, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2859, size: 160, elements: !141)
!141 = !{!142, !144, !145, !146, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !6, line: 2860, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !39, line: 27, baseType: !46)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !140, file: !6, line: 2861, baseType: !143, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !140, file: !6, line: 2862, baseType: !143, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !140, file: !6, line: 2864, baseType: !143, size: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !140, file: !6, line: 2865, baseType: !143, size: 32, offset: 128)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!149 = !DILocalVariable(name: "ctx", arg: 1, scope: !136, file: !3, line: 47, type: !139)
!150 = !DILocalVariable(name: "index", scope: !136, file: !3, line: 49, type: !113)
!151 = !DILocalVariable(name: "xsk_index", scope: !136, file: !3, line: 49, type: !113)
!152 = !DILocalVariable(name: "ack_num", scope: !136, file: !3, line: 50, type: !82)
!153 = !DILocalVariable(name: "data", scope: !136, file: !3, line: 52, type: !23)
!154 = !DILocalVariable(name: "data_end", scope: !136, file: !3, line: 53, type: !23)
!155 = !DILocalVariable(name: "eth", scope: !136, file: !3, line: 55, type: !25)
!156 = !DILocalVariable(name: "iph", scope: !136, file: !3, line: 59, type: !41)
!157 = !DILocalVariable(name: "vtlh", scope: !136, file: !3, line: 67, type: !65)
!158 = !DILocalVariable(name: "recv_csum", scope: !136, file: !3, line: 75, type: !54)
!159 = !DILocalVariable(name: "compute_csum", scope: !136, file: !3, line: 77, type: !54)
!160 = !DILocalVariable(name: "temp_ip", scope: !161, file: !3, line: 95, type: !163)
!161 = distinct !DILexicalBlock(scope: !162, file: !3, line: 93, column: 14)
!162 = distinct !DILexicalBlock(scope: !136, file: !3, line: 81, column: 12)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !37, line: 27, baseType: !143)
!164 = !DILocalVariable(name: "____fmt", scope: !165, file: !14, line: 228, type: !191)
!165 = distinct !DILexicalBlock(scope: !166, file: !14, line: 228, column: 7)
!166 = distinct !DILexicalBlock(scope: !167, file: !14, line: 227, column: 27)
!167 = distinct !DILexicalBlock(scope: !168, file: !14, line: 227, column: 7)
!168 = distinct !DISubprogram(name: "vtl_csum", scope: !14, file: !14, line: 221, type: !169, isLocal: true, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!113, !23, !23, !82}
!171 = !{!172, !173, !174, !175, !176, !177, !164, !178, !179, !186, !187, !194, !195, !202}
!172 = !DILocalVariable(name: "data", arg: 1, scope: !168, file: !14, line: 221, type: !23)
!173 = !DILocalVariable(name: "data_end", arg: 2, scope: !168, file: !14, line: 221, type: !23)
!174 = !DILocalVariable(name: "csum", arg: 3, scope: !168, file: !14, line: 221, type: !82)
!175 = !DILocalVariable(name: "y", scope: !168, file: !14, line: 223, type: !113)
!176 = !DILocalVariable(name: "sum", scope: !168, file: !14, line: 224, type: !49)
!177 = !DILocalVariable(name: "eth", scope: !168, file: !14, line: 226, type: !25)
!178 = !DILocalVariable(name: "iph", scope: !168, file: !14, line: 232, type: !41)
!179 = !DILocalVariable(name: "____fmt", scope: !180, file: !14, line: 234, type: !183)
!180 = distinct !DILexicalBlock(scope: !181, file: !14, line: 234, column: 7)
!181 = distinct !DILexicalBlock(scope: !182, file: !14, line: 233, column: 27)
!182 = distinct !DILexicalBlock(scope: !168, file: !14, line: 233, column: 7)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 272, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 34)
!186 = !DILocalVariable(name: "vtlh", scope: !168, file: !14, line: 242, type: !65)
!187 = !DILocalVariable(name: "____fmt", scope: !188, file: !14, line: 244, type: !191)
!188 = distinct !DILexicalBlock(scope: !189, file: !14, line: 244, column: 7)
!189 = distinct !DILexicalBlock(scope: !190, file: !14, line: 243, column: 28)
!190 = distinct !DILexicalBlock(scope: !168, file: !14, line: 243, column: 7)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 280, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 35)
!194 = !DILocalVariable(name: "d", scope: !168, file: !14, line: 248, type: !83)
!195 = !DILocalVariable(name: "____fmt", scope: !196, file: !14, line: 250, type: !199)
